using System;
using System.Collections.Generic;
using System.Text;

namespace Workers
{
    public class Repository
    {
        /// <summary>
        /// База данных женских имён
        /// </summary>
        static readonly string[] firstNamesF;

        /// <summary>
        /// База данных мужских имён
        /// </summary>
        static readonly string[] firstNamesM;

        /// <summary>
        /// База данных имён
        /// </summary>
        static readonly string[] firstNames;

        /// <summary>
        /// База данных фамилий
        /// </summary>
        static readonly string[] lastNames;

        /// <summary>
        /// Генератор псевдослучайных чисел
        /// </summary>
        static Random randomize;

        /// <summary>
        /// Статический конструктор, в котором создются
        /// данные о именах и фамилиях баз данных firstNames и lastNames
        /// </summary>
        static Repository()
        {
            randomize = new Random(); // Размещение в памяти генератора случайных чисел

            // Размещение женских имен в базе данных firstNames
            firstNamesF = new string[] {
                "Агата",
                "Агния",
                "Аделина",
                "Аида",
                "Аксинья",
                "Александра",
                "Алена",
                "Алина",
                "Алиса",
                "Алия",
                "Алла",
                "Альбина",
                "Амелия",
                "Амина",
                "Анастасия",
                "Ангелина",
                "Анна",
                "Антонина",
                "Ариана",
                "Арина",
                "Валентина",
                "Валерия",
                "Варвара",
                "Василина",
                "Василиса",
                "Вера",
                "Вероника",
                "Виктория",
                "Виолетта",
                "Владислава",
                "Галина",
                "Дарина",
                "Дарья",
                "Диана",
                "Дина",
                "Ева",
                "Евангелина",
                "Евгения",
                "Екатерина",
                "Елена",
                "Елизавета",
                "Есения",
                "Жанна",
                "Зарина",
                "Злата",
                "Илона",
                "Инна",
                "Ирина",
                "Камилла",
                "Карина",
                "Каролина",
                "Кира",
                "Клавдия",
                "Кристина",
                "Ксения",
                "Лариса",
                "Лейла",
                "Лиана",
                "Лидия",
                "Лилия",
                "Лина",
                "Лия",
                "Любовь",
                "Людмила",
                "Майя",
                "Маргарита",
                "Марианна",
                "Марина",
                "Мария",
                "Мелания",
                "Мила",
                "Милана",
                "Милена",
                "Мирослава",
                "Надежда",
                "Наталья",
                "Нелли",
                "Ника",
                "Нина",
                "Оксана",
                "Олеся",
                "Ольга",
                "Полина",
                "Регина",
                "Сабина",
                "Светлана",
                "София",
                "Стефания",
                "Таисия",
                "Тамара",
                "Татьяна",
                "Ульяна",
                "Эвелина",
                "Элина",
                "Эльвира",
                "Эльмира",
                "Эмилия",
                "Юлия",
                "Яна",
                "Ярослава"

                };
            // Размещение мужских имен в базе данных firstNames
            firstNamesM = new string[] {
                "Алан",
                "Александр",
                "Алексей",
                "Альберт",
                "Анатолий",
                "Андрей",
                "Антон",
                "Арсен",
                "Арсений",
                "Артем",
                "Артемий",
                "Артур",
                "Богдан",
                "Борис",
                "Вадим",
                "Валентин",
                "Валерий",
                "Василий",
                "Виктор",
                "Виталий",
                "Владимир",
                "Владислав",
                "Всеволод",
                "Вячеслав",
                "Геннадий",
                "Георгий",
                "Герман",
                "Глеб",
                "Гордей",
                "Григорий",
                "Давид",
                "Дамир",
                "Даниил",
                "Демид",
                "Демьян",
                "Денис",
                "Дмитрий",
                "Евгений",
                "Егор",
                "Елисей",
                "Захар",
                "Иван",
                "Игнат",
                "Игорь",
                "Илья",
                "Ильяс",
                "Камиль",
                "Карим",
                "Кирилл",
                "Клим",
                "Константин",
                "Лев",
                "Леонид",
                "Макар",
                "Максим",
                "Марат",
                "Марк",
                "Марсель",
                "Матвей",
                "Мирон",
                "Мирослав",
                "Михаил",
                "Назар",
                "Никита",
                "Николай",
                "Олег",
                "Павел",
                "Петр",
                "Платон",
                "Прохор",
                "Рамиль",
                "Ратмир",
                "Ринат",
                "Роберт",
                "Родион",
                "Роман",
                "Ростислав",
                "Руслан",
                "Рустам",
                "Савва",
                "Савелий",
                "Святослав",
                "Семен",
                "Сергей",
                "Станислав",
                "Степан",
                "Тамерлан",
                "Тимофей",
                "Тимур",
                "Тихон",
                "Федор",
                "Филипп",
                "Шамиль",
                "Эдуард",
                "Эльдар",
                "Эмиль",
                "Эрик",
                "Юрий",
                "Ян",
                "Ярослав"

                };
            // Размещение фамилий в базе данных lastNames
            lastNames = new string[]
            {
                "Смирнов",
                "Иванов",
                "Кузнецов",
                "Соколов",
                "Попов",
                "Лебедев",
                "Козлов",
                "Новиков",
                "Морозов",
                "Петров",
                "Волков",
                "Соловьёв",
                "Васильев",
                "Зайцев",
                "Павлов",
                "Семёнов",
                "Голубев",
                "Виноградов",
                "Богданов",
                "Воробьёв",
                "Фёдоров",
                "Михайлов",
                "Беляев",
                "Тарасов",
                "Белов",
                "Комаров",
                "Орлов",
                "Киселёв",
                "Макаров",
                "Андреев",
                "Ковалёв",
                "Ильин",
                "Гусев",
                "Титов",
                "Кузьмин",
                "Кудрявцев",
                "Баранов",
                "Куликов",
                "Алексеев",
                "Степанов",
                "Яковлев",
                "Сорокин",
                "Сергеев",
                "Романов",
                "Захаров",
                "Борисов",
                "Королёв",
                "Герасимов",
                "Пономарёв",
                "Григорьев",
                "Лазарев",
                "Медведев",
                "Ершов",
                "Никитин",
                "Соболев",
                "Рябов",
                "Поляков",
                "Цветков",
                "Данилов",
                "Жуков",
                "Фролов",
                "Журавлёв",
                "Николаев",
                "Крылов",
                "Максимов",
                "Сидоров",
                "Осипов",
                "Белоусов",
                "Федотов",
                "Дорофеев",
                "Егоров",
                "Матвеев",
                "Бобров",
                "Дмитриев",
                "Калинин",
                "Анисимов",
                "Петухов",
                "Антонов",
                "Тимофеев",
                "Никифоров",
                "Веселов",
                "Филиппов",
                "Марков",
                "Большаков",
                "Суханов",
                "Миронов",
                "Ширяев",
                "Александров",
                "Коновалов",
                "Шестаков",
                "Казаков",
                "Ефимов",
                "Денисов",
                "Громов",
                "Фомин",
                "Давыдов",
                "Мельников",
                "Щербаков",
                "Блинов",
                "Колесников",
                "Карпов",
                "Афанасьев",
                "Власов",
                "Маслов",
                "Исаков",
                "Тихонов",
                "Аксёнов",
                "Гаврилов",
                "Родионов",
                "Котов",
                "Горбунов",
                "Кудряшов",
                "Быков",
                "Зуев",
                "Третьяков",
                "Савельев",
                "Панов",
                "Рыбаков",
                "Суворов",
                "Абрамов",
                "Воронов",
                "Мухин",
                "Архипов",
                "Трофимов",
                "Мартынов",
                "Емельянов",
                "Горшков",
                "Чернов",
                "Овчинников",
                "Селезнёв",
                "Панфилов",
                "Копылов",
                "Михеев",
                "Галкин",
                "Назаров",
                "Лобанов",
                "Лукин",
                "Беляков",
                "Потапов",
                "Некрасов",
                "Хохлов",
                "Жданов",
                "Наумов",
                "Шилов",
                "Воронцов",
                "Ермаков",
                "Дроздов",
                "Игнатьев",
                "Савин",
                "Логинов",
                "Сафонов",
                "Капустин",
                "Кириллов",
                "Моисеев",
                "Елисеев",
                "Кошелев",
                "Костин",
                "Горбачёв",
                "Орехов",
                "Ефремов",
                "Исаев",
                "Евдокимов",
                "Калашников",
                "Кабанов",
                "Носков",
                "Юдин",
                "Кулагин",
                "Лапин",
                "Прохоров",
                "Нестеров",
                "Харитонов",
                "Агафонов",
                "Муравьёв",
                "Ларионов",
                "Федосеев",
                "Зимин",
                "Пахомов",
                "Шубин",
                "Игнатов",
                "Филатов",
                "Крюков",
                "Рогов",
                "Кулаков",
                "Терентьев",
                "Молчанов",
                "Владимиров",
                "Артемьев",
                "Гурьев",
                "Зиновьев",
                "Гришин",
                "Кононов",
                "Дементьев",
                "Ситников",
                "Симонов",
                "Мишин",
                "Фадеев",
                "Комиссаров",
                "Мамонтов",
                "Носов",
                "Гуляев",
                "Шаров",
                "Устинов",
                "Вишняков",
                "Евсеев",
                "Лаврентьев",
                "Брагин",
                "Константинов",
                "Корнилов",
                "Авдеев",
                "Зыков",
                "Бирюков",
                "Шарапов",
                "Никонов",
                "Щукин",
                "Дьячков",
                "Одинцов",
                "Сазонов",
                "Якушев",
                "Красильников",
                "Гордеев",
                "Самойлов",
                "Князев",
                "Беспалов",
                "Уваров",
                "Шашков",
                "Бобылёв",
                "Доронин",
                "Белозёров",
                "Рожков",
                "Самсонов",
                "Мясников",
                "Лихачёв",
                "Буров",
                "Сысоев",
                "Фомичёв",
                "Русаков",
                "Стрелков",
                "Гущин",
                "Тетерин",
                "Колобов",
                "Субботин",
                "Фокин",
                "Блохин",
                "Селиверстов",
                "Пестов",
                "Кондратьев",
                "Силин",
                "Меркушев",
                "Лыткин",
                "Туров"

            };
        }

        /// <summary>
        /// База данных работников, в которой хранятся 
        /// Таб. номер, имя, фамилия, возраст, должность, зарплата, отдел и загрузка каждого сотрудника
        /// </summary>
        public List<Worker> Workers { get; set; }

        /// <summary>
        /// Конструктор, заполняющий базу данных Workers
        /// </summary>
        /// <param name="Count">Количество сотрудников, которых нужно создать</param>
        public Repository(int Count, Department department)
        {
            this.Workers = new List<Worker>(); // Выделение памяти для хранения базы данных Workers

            for (int i = 0; i < Count / 2; i++)    // Заполнение базы данных Workers женщинами. Выполняется Count/2 раз
            {
                // Добавляем новую работницу в базы данных Workers
                this.Workers.Add(
                    new Worker(
                        //int Tabnum, string FirstName, string LastName, int Age, string Position, uint Salary, Department Department, int Charge
                        //присваиваем табельный номер
                        i,
                        // выбираем случайное женское имя из базы данных имён
                        firstNames[Repository.randomize.Next(Repository.firstNamesF.Length)],

                        // выбираем случайную фамилию из базы данных фамилий
                        lastNames[Repository.randomize.Next(Repository.($"{lastNames}'а'").Length)],//?????????

                        // Генерируем случайный возраст в диапазоне 19 лет - 60 лет
                        randomize.Next(19, 60),

                        //выбираем случайную должность
                        Department.Position[Repository.randomize.Next()],

                        // Генерируем случайную зарплату в диапазоне 10000руб - 80000руб
                        randomize.Next(10000, 80000),

                        Department Department,

                        // Генерируем случайное количество проектов в диапазоне 1 - 10 
                        randomize.Next(1, 10)
                        ));
            }


            for (int i = Count / 2; i < Count; i++)    // Заполнение базы данных Workers мужчинами. Выполняется Count/2 раз
            {
                // Добавляем нового работника в базы данных Workers
                this.Workers.Add(
                    new Worker(
                        //int Tabnum, string FirstName, string LastName, int Age, string Position, uint Salary, Department Department, int Charge
                        //присваиваем табельный номер
                        i,
                        // выбираем случайное женское имя из базы данных имён
                        firstNames[Repository.randomize.Next(Repository.firstNamesM.Length)],

                        // выбираем случайную фамилию из базы данных фамилий
                        lastNames[Repository.randomize.Next(Repository.lastNames.Length)],

                        // Генерируем случайный возраст в диапазоне 19 лет - 60 лет
                        randomize.Next(19, 60),

                        //выбираем случайную должность
                        Department.Position[Repository.randomize.Next()],

                        // Генерируем случайную зарплату в диапазоне 10000руб - 80000руб
                        randomize.Next(10000, 80000),

                        Department Department,

                        // Генерируем случайное количество проектов в диапазоне 1 - 10 
                        randomize.Next(1, 10)
                        ));
            }
        }

        /// <summary>
        /// Метод вывода базы данных Workers в консоль
        /// </summary>
        /// <param name="Text">Вспомогательный текст, который будет напечатан перед выводом базы</param>
        public void Print(string Text)
        {
            Console.WriteLine(Text);    // Печать в консоль вспомогательного текста

            // Изменяем цвет шрифта для печати в консоли на DarkBlue
            Console.ForegroundColor = ConsoleColor.DarkBlue;

            // Выводим Заголовки колонок базы данных Таб. номер, имя, фамилия, возраст, должность, зарплата, отдел и загрузка
            Console.WriteLine($"{"Табельный номер",6}{"Имя",15} {"Фамилия",15} {"Возраст",3} {"Должность",10} {"Зарплата",15} {"Отделт",10} {"Количество проектов",3}");

            // Изменяем цвет шрифта для печати в консоли на Gray
            Console.ForegroundColor = ConsoleColor.Gray;


            foreach (var worker in this.Workers) //
            {                                    // Печатаем в консоль всех работников
                Console.WriteLine(worker);       //
            }                                    //

            Console.WriteLine($"Итого: {this.Workers.Count}\n");    // Сводный отчёт. Сколько работников распечатано
        }



    }
}
